#### SetFamilyName Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

Sets the family name for the DirectShapeType.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void SetFamilyName( 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetFamilyName ( _ 	name As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetFamilyName( 	String^ name ) ``` |

#### Parameters

name
:   Type:  System String
     Family name for the DirectShapeType.

# Remarks

By default the family name is either Direct Shape or a category-specific name. When a category-specific name is used the family name cannot be set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The element type name was empty, contained invalid characters, or was invalid for the specific element type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The given DirectShapeType has a category which does not support a custom family name. |

# See Also

DirectShapeType Class

Autodesk.Revit.DB Namespace